// Вопросы:
// 1) Что вообще за `defer`? Почему порядок выполнения именно такой?
// 2) Что общего у `defer` и стека?
/* Ответы:
1)Defer вызов откладывается до выхода из окружающей функции(например мейн). В рамках того где вызвана.
В основном используется для тех случаев, когда мы хотим что то сделать при return или panic'a. Важно записать defer до нужного return.
не дошло, вызов не сработает.
2)Вызовы defer находятся в стеке если последний инициализирован, он выполниться первый. Самый ранний будет последним.
*/
package main

import "fmt"

func main() {
	defer fmt.Println(1)
	defer fmt.Println(2)
	defer fmt.Println(3)
}
