// Вопросы:
// 1) Почему этот код не компилируется? Что не так?
// 2) Что нужно исправить , чтобы код запустился и корректно отработал?
// 3) Какие есть случаи, когда нужно использовать именно `var` и именно `:=` ?
/** Ответы:
1) Потому что изначально мы создали переменную x строкой 25 
и потом попытались создать уже существующее значенеи в строке 26после создание переменной мы можем только присвоить ей значение.
2) Чтобы код запустился нужно убрать двоеточие, так как переменная уже создана и мы можем ей только просвоить значение
3) Если мы хотим указать тип данных переменной необходимо использовать конструкцию  как пример var x string = "Привет" , когда мы указываем := го само 
решает какой тип данных будет у значения судя по его значению после равно. Например x:= "привет" для го это значит что мы используем строку, так как двойные ковычки.
или например когда мы хотим создать какой то конкретный тип данных например float32. Если мы создадим переменную например x:= 33.3 go автоматически присвоит этим данным
float64(8 байт памяти).
Решение соотвественно : 
package main

func main() {
	var x int
	x = 10
	_ = x // это чтобы компилятор не ругался
}
*/
package main

func main() {
	var x int
	x = 10
	_ = x
}
