// Вопросы:
// 1) Почему здесь функция может изменять слайс извне?
// 2) Как именно передается слайс? По ссылке или по значению?
// 3) Что хранится внутри слайса, если рассматривать его как структуру данных в го?
/* Ответы:
1) Потому что функция обращается к тому же самому массиву и меняет его 0 элемент.
2)По значению. Мы просто скопировали внутри с то что у нас лежит в а и заменили 1 элемент
поэтому они указывают на один и тот же массив, и он остается один в памяти.
3)ptr -  адрес первого элемента массива в памяти
 len - длина (сколько элементов сейчас)
cap - ёмкость (сколько элементов поместится)
*/
package main

import "fmt"

func change(s []int) {
	s[0] = 100
}

func main() {
	a := []int{1, 2, 3}
	change(a)
	fmt.Println(a)
}
