//Вопросы:
// 1) Чем отличаются Inc1 и Inc2?
// 2)На что влияет `*`? 
// 3) В чем разница pointer ресивера и value ресивера? Когда нужен один, а когда другой?
/* Ответы
1) Inc1 получается копию счетчика и его же и увеличивает. Inc 2 получает адрес оригинала и изменяет сам оригинал
2) * это указатель. Получаето адрес оригинала и работает прямо с ним. Без * работает с копией.
3) Поинт ресивер используется для работы с работы с оригинальными данными(может менять ее структуру), а валью с копией(изменения не затрагивают оригинал)
*/
package main

import "fmt"

type Counter struct {
	n int
}

func (c Counter) Inc1() {
	c.n++
}

func (c *Counter) Inc2() {
	c.n++
}
func main() {
	var c Counter
	c.Inc1()
	fmt.Println(c.n)
	c.Inc2()
	fmt.Println(c.n)
}
