// Вопросы:
// 1) Почему присваивание нового значения произошло , а в консоль принтится все равно старое значение?
// 2) В какой момент вычисляются аргументы для defer?
// 3) Как можно переписать это код, чтобы мы все-таки получали в выводе `20`?
/* Ответы:
1) Потому что после выполения defer устроен так что аргументы дефер функции 
вычисляются в момент выполнения строки с ним, и аргумент запоминается.
2) Сразу именно аргументы посчитает сразу, а функия выполнится в конце.
3) Перенести строчку с вызовом defer после присвоения нового значения 
переменной либо вынести в функцию замыкание
*/
package main

import "fmt"

func main() {
	x := 10
	defer fmt.Println(x)
	x = 20
}
