// Вопросы:
// 1) Почему эта мапа nil ?
// 2) Почему операция чтения из такой мапы работает, а операция записи нет?
// 3) Почему мы получаем именно панику при записи?
// 4) Чем nil мапа отличается от пустой мапы, созданной через make()?
/* Ответы: 
	1) Потому что мы пока только создали перменную сама мапа где храняться значения
	2) Читать можно потому что nil считается что ключ 
	отсутствует и возвращает нулевое значение в зависимости от типа мапа (0 для инта).
	3) Запись в nil мап это ошибка разработчика. Мап забыли создать, и записывать некуда.
 	Вернуть error тоже нельзя, потому что m["x"] = 10 это просто присваивание, а не вызов
 	функции, у которой есть результат. Поэтому Go сразу вызывает панику и останавливает программу.
 	4) У nil мапы отсутствует ссылка на хранилище внутри, а пустая мапа созданная через мейк автоматически создает ей ссылку на ссылку на хеш-таблицу где ключ значение. По аналогии со слайсом ptr, только в мапе просто ссылка на хеш таблицу
*/
package main

import "fmt"

func main() {
	var  m map[string]int

	m["x"] = 10
	fmt.Println(m["x"])
}
