// Вопросы:
// 1) Что не так с этим кодом? Почему он не компилируется?
// 2) Какая есть особенность хранения элементов в мапе?
// 3) Почему можно брать указатель на элемент в слайсе, а в мапе нельзя?
/* Ответы
1) Go запрящает использовать указатели в мапе, в ответе на второй вопрос расписал почему.
2) В целом нельзя спомощью указателя получить какой то элемент, потому что в мапе данные храняться в хеш таблицы и когда мапа разрастается, может измениться положение элементов в памяти.
3) Потому что слайс под капотом обращается к массиву, а в массиве элементы идут поочередно, и в случае со слайсом достать корректно получится, в случае с мапом где адрес значения нестабилен это не работает.
*/
package main

func main() {
	m := map[string]int{"a": 1}
	_ = m["a"]
}
