// Вопросы:
// 1) Почему в выводе оба раза `0` , если мы записали только одно значение?
// 2) Зачем , для работы с мапой, нужна конструкция `value, ok := m[key]`? Что она делает?
// 3) Почему эта конструкция важна в реальном коде?
/* Ответы 
	1) Потому что элемент a равен 0, а элемент ключ b отсутствует, поэтому го у ненайденного ключа пишет 0 (смотрит по типу данных, в конкретном случае инт поэтому 0).
	2) Конструкция помогает понять существует ли значение по данному ключу или нет. Обычно пишется через условный оператор. Возвращает само значение и bool (true если такой ключ есть, false - нет)
	3) Помогает понять при работе , реально ли существует ли реально запись в массиве или выводит 0 просто потому что такого ключа нет.
*/
package main

import "fmt"

func main() {
	m := map[string]int{
		"a": 0,
	}
	
	fmt.Println(m["a"])
	fmt.Println(m["b"])
}