// Вопросы:
// 1) Почему тут поведение отличается от предыдущей задачи?
// 2) Что происходит со слайсом, когда мы вызываем append()?
// 3) Когда массив под капотом слайса меняется на новый , а когда остается старый?
// 4) Как с помощью cap() можно прогнозировать, когда именно будет создаваться новый массив под капотом слайса?
/*
Ответы :
1) Здесь поведение отлично, так как мы передаем массив в функцию change в которой у нас есть функция append,
по умолчанию cap = 3 и уже нехватет места для нового элемента.
Под капотом создается новый массив уже с 4 на конце и в начале 0 элемента равен 100. В теории старый массив a уже не нужен если бы он не использовался его бы зачистил garbage collector fmt.Println("outside:", a)  если бы мы убрали это
2) append добавляет в конец слайса элемент и сохраняет его.
3) Если cap в слайсе уже равен количеству элементов как в текущем примере, append вынуждено создает новый массив и его ptr отличен.
4) Как len = cap, append создаст новый массив уже с другим ptr. Если len < cap, то создат в текущем слайсе с тем же ptr.
Если места становится недостаточно и вызывается функцию append, то cap увеличивается в двое судя по тестовому циклу
s := []int{1, 2, 3}
	for i := 4; i <= 8; i++ {
		s = append(s, i)
		fmt.Println(len(s), cap(s))
	}

*/
package main

import "fmt"

func change(s []int) {
	s = append(s, 4)
	s[0] = 100
	fmt.Println("inside:", s)
}

func main() {
	a := []int{1, 2, 3}
	change(a)
	fmt.Println("outside:", a)
}
