// Вопросы:
// 1) Почему вывод в консоль именно такой?
// 2) Как именно передается значение в функцию?
// 3) Что нужно исправить в этом коде, чтобы в консоль вывелось 100? (Кроме варианта fmt.Println(100))
// Вопросы:
// 1) Почему вывод в консоль именно такой?
// 2) Как именно передается значение в функцию?
// 3) Что нужно исправить в этом коде, чтобы в консоль вывелось 100? (Кроме варианта fmt.Println(100))
/* ОТВЕТЫ :
1) Во первых , чтобы отобразить результат функции нам нужно что функциия что то возвращала(return x) и мы по сути просто подставляем значение из переменной
в функцию которая ничего не возвращает, поэтому у нас и получается начальный варинат переменной. Но даже если учесть это у нас никаких манипуляций с данными нет. Мы просто просвоили переменную и вывели ее
а x = 100 он просто константа.
2)Значение в функции передается здесь change(a) , компилятор смотрит что тип данных тоже инт и пропускает это.
3) Минимально, мы можем просто написать reutrn x в 22 строке внутри функции, указать тип возвращаемого значения. Вызвать функцию анонимно например через переменную h и Println(h).
Так как у нас в функции по сути просвоена константа, неважно какое значение мы передадим оно всегда перетрет его и выведет 100.
package main
Код для вывода 100:
import "fmt"

func change(x int) int {
	x = 100
	return x
}

func main() {
	a := 10
	h := change(a)

	fmt.Println(h)
}
*/
package main

import "fmt"

func change(x int) {
	x = 100
}

func main() {
	a := 10
	change(a)
	fmt.Println(a)
}
