// Вопросы:
// 1) Почему здесь в строке 6 букв, а длина строки не равна 6?
// 2) Что такое строка в го? Это набор байт или набор символов?
// 3) В каких случах правильнее использовать []rune , а в каких []byte?
// 4) Почему в го символы не весят одинаково, как в C++?
/* Ответы
1,2) Данные храняться в байтах в UTF-8. Тоесть Латиница 1 байт, Кириллица 2 байта. Поэтому вывод 12.
3)rune используем когда хотим поработать именно со строкой посчитать буквы, перевернуть строку или заменить какую то букву например. в байтах используем когда дело касается расчетов
 byte используется именно для работы с байтами. Когда например зашифровать строку или закодировать.
4) В GO символы храняться в UTF 8. В С++ как настроишь кодировку, насколько мне известно можно и UTF-8, тогда будет одинаково. Ну в целом если вопрос по ASCII не вникал, но там нет кириллицы точно знаю, и данные там имеют другой вес.
*/
package main

import "fmt"

func main() {
	s := "привет"
	fmt.Println(len(s))
}
