// Вопросы:
// 1) Почему массив `a` не изменился?
// 2) Почему массив работает не так как слайс в го?
// 3) Чем отличаются [3]int{} и []int{}? Какие есть оптимальные кейсы использования массива и слайса
/* Ответы
1)Массив а не будет изменен потому что с ним никаких манипуляций и не происходило, все что мы сделали 
это создали переменную b которая равна массиву а, и и уже в новый массив b изменили первый элемент на 100
2) Потому что массив хранит сами элементы в переменной, а слайс хранит только  
заголовок (ptr, len, cap), и копируется он а не данные поэтому
два слайса могут смотреть на один массив под капотом.
3)Отпимальным кейсом для использования массива является то , когда нам нужна целостность данные и когда набор элементов фиксирован например uuid'ы.
В остальных случаях когда кол-во элементов неизветсно или меняется. 
*/
package main

import "fmt"

func main() {
	a := [3]int{1, 2, 3}
	b := a
	b[0] = 100

	fmt.Println("a:", a)
	fmt.Println("b:", b)
}