// Вопросы:
// 1)Что делает этот код? Как работает такой `for`?
// 2) Почему слайс `a` не изменился?
// 3) Что поправить в коде, чтобы слайс изменился?
// Овтеты:
// 1) Код идёт по слайсу a и умножает v на 10. Цикл for _, v := range a
// на каждой итерации
// копирует очередной элемент в v. _ значит, что индекс нам не нужен.
// 2) v это копия элемента, а не сам элемент. v *= 10 меняет только копию,
// поэтому слайс a остаётся [1 2 3].
// 3) Нужно изменить сигнатуру цикла, мы не можем просто пропускать индекс таком случае,
// потому что нам куда то нужно записывать значение.
// Мой вариант:
// a := []int{1, 2, 3}
// 	for i := range a {
// 		a[i] *= 10
// 	Или
// for i, v := range a {
//	a[i] = v * 10

package main

import "fmt"

func main() {
	a := []int{1, 2, 3}
	for _, v := range a {
		v *= 10
	}
	fmt.Println(a)
}
