//Вопросы:
// 1) Почему теперь изменения не повлияли на `a`?
// 2) В каких случаях нужно использовать copy() , а в каких передавать через присваивание (b := a)?
/*Ответы
1)Потому что мы создали новый слайс через функцию мейк и copy(мейк создал новый слайс, copy вставил туда значения), я приводил пример создания в 6 задачке.
2)copy используется для компирования данные слайса из какого то слайса в новый слайс, а присвание b:=а скопирует только ptr len cap, в памяти также будет ссылаться к значениями массива если вдруг что то захотим изменить
присваивание подходит для чтения данных или copy когда нам нужен отдельный автономный слайс, который в случае чего не поменяет оригинальные данные в массиве.
*/
package main

import "fmt"

func main() {
	a := []int{1, 2, 3}
	b := make([]int, len(a))
	copy(b, a)

	b[0] = 100

	fmt.Println("a:", a)
	fmt.Println("b:", b)
}
