// Подобные задачи часто встречаются на собеседованиях, поэтому лучше с самого начала научиться разбираться в них
// Вопросы:
// 1) Почему здесь, если мы внесли изменения в  `b`, то это отразилось и на `a`?
// 2) Что за массив лежит в структуре слайса и какое он имеет здесь отношение?
// 3) Какие изменения внести в код, чтобы сделать `b` независимым слайсом от `a`?
/* Ответы
Потому что срез b сформировался, и его ptr все также хранит данные массива(слайс хранит только ссылку первого элемента ptr). Получается что среза у нас два на основе одного массива.
В структуре двух слайсов лежит массив а , потом при присвоении 0 элемента в слайсе b, в начальном массиве а меняется 1 элемент.
Чтобы сделать b независимым слайсом можно вынести можно импортирновать пакет slices и вызвать функцию clone, это самый простой и читаемый вариант либо же использовать make и copy
Вариант  1 с импортом slices
package main

import ("fmt"
 . "slices")

func main() {
	a := []int{1, 2, 3, 4, 5}
	b := Clone(a[1:4]) // 2 3 4
	b[0] = 100 // 100 3 4

	fmt.Println("a:", a)
	fmt.Println("b:", b)
}
Вариант 2 с make copy
import ("fmt")
func main() {
	a := []int{1, 2, 3, 4, 5}
	b := make([]int, 3)
	copy(b, a[1:4])
	b[0] = 100

	fmt.Println("a:", a)
	fmt.Println("b:", b)
}
}
*/
package main

import "fmt"

func main() {
	a := []int{1, 2, 3, 4, 5}
	b := a[1:4]
	b[0] = 100

	fmt.Println("a:", a)
	fmt.Println("b:", b)
}
